// counter.h

#ifndef COUNTERH
#define COUNTERH

#include <iostream>

class Counter
{
// ------------------------------------------------------------------------------
// PUBLIC
public:	

	/*
	возможность увеличить своё значение на 1
	*/
	void increase();

	/*
	возможность уменьшить своё значение на 1
	*/
	void decrease();

	/*
	возможность посмотреть своё текущее значение
	*/
	int get_counter();

	// ------------------------------------------------------------------------------
	// КОНСТРУКТОРЫ

	/*
	Конструктор по умолчанию
	counter = 1
	*/
	Counter()
	{
		counter_ = 1;
	}

	/*
	Конструктор с параметром
	counter = аргумент
	*/
	Counter(int counter)
	{
		counter_ = counter;
	}

// ------------------------------------------------------------------------------
// PRIVATE
private:

	int counter_;
};

#endif // COUNTERH