// counter.h

#ifndef COUNTERH
#define COUNTERH

#include <iostream>

class Counter
{
private:
	// ------------------------------------------------------------------------------
	// PRIVATE АРГУМЕНТЫ
	int counter_;
protected:
	// ------------------------------------------------------------------------------
	// PROTECTED МЕТОДЫ
public:
	// ------------------------------------------------------------------------------
	// PUBLIC МЕТОДЫ

	/*
	возможность увеличить своё значение на 1
	*/
	void increase()
	{
		counter_++;
	}

	/*
	возможность уменьшить своё значение на 1
	*/
	void decrease()
	{
		counter_--;
	}

	/*
	возможность посмотреть своё текущее значение
	*/
	int get_counter()
	{
		return counter_;
	}

	// ------------------------------------------------------------------------------
	// КОНСТРУКТОРЫ

	/*
	Конструктор по умолчанию
	counter = 1
	*/
	Counter()
	{
		counter_ = 1;
	}

	/*
	Конструктор с параметром
	counter = аргумент
	*/
	Counter(int counter)
	{
		counter_ = counter;
	}
};

#endif // COUNTERH